Tekla.Structures.Drawing.AngleDimension
The AngleDimension class defines an angle dimension between two lines. The dimension can be shown
by a triangle or in degrees. You can also enter the triangle base length.
The following code inserts an angle dimension:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
Point origin = new Point(2000, 2000);
Point point1 = new Point(3000, 5000);
Point point2 = new Point(6000, 2000);
AngleDimension myAngle = new AngleDimension(_view, origin, point1, point2, 200);
myAngle.Insert();
}
}

Tekla.Structures.Drawing.AngleDimension.Attributes
Gets or sets the angle dimension attributes.

Tekla.Structures.Drawing.AngleDimension.Origin
Gets or sets the origin of the dimension.

Tekla.Structures.Drawing.AngleDimension.Point1
Gets or sets the first point.

Tekla.Structures.Drawing.AngleDimension.Point2
Gets or sets the second point.

Tekla.Structures.Drawing.AngleDimension.Distance
Gets or sets the distance (from the origin to the second point's direction).
The distance is measured in paper millimeters.

Tekla.Structures.Drawing.AngleDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new angle dimension instance using three points.
View: The view to be used.
Origin: The origin to be used.
Point1: The first point to be used.
Point2: The second point to be used.
Distance: The distance of the angle sign from the origin to the first point.

Tekla.Structures.Drawing.AngleDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.AngleDimensionAttributes)
Creates a new angle dimension instance using three points.
View: The view to be used.
Origin: The origin to be used.
Point1: The first point to be used.
Point2: The second point to be used.
Distance: The distance of the angle sign from the origin to the first point.
Attributes: The angle dimension attributes to be used.

Tekla.Structures.Drawing.AngleDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Double)
Creates a new angle dimension instance using the origin and two vectors relative to the origin.
View: The view to be used.
Origin: The origin to be used.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Distance: The distance to be used.

Tekla.Structures.Drawing.AngleDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Drawing.AngleDimensionAttributes)
Creates a new angle dimension instance using the origin and two vectors relative to the origin.
View: The view to be used.
Origin: The origin to be used.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Distance: The distance to be used.
Attributes: The angle dimension attributes to be used.

Tekla.Structures.Drawing.AngleDimension.GetAngle
Gets the angle value (in degrees).
Returns: The angle value.

Tekla.Structures.Drawing.AngleDimension.GetDimensionSet
The angle dimension doesn't have a dimension set.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.

Tekla.Structures.Drawing.AngleDimension.GetDimensionSet(System.Boolean)
The angle dimension doesn't have a dimension set.
Select: Whether to select the object from the database or not.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.

Tekla.Structures.Drawing.AngleDimension.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.AngleDimension.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.AngleDimension.Insert
Inserts the dimension into the database.
Returns: True if the insertion succeeds.

Tekla.Structures.Drawing.AngleDimension.Select
Selects the angle dimension from the database.
Returns: True if the selection succeeds.

Tekla.Structures.Drawing.AngleDimension.Modify
Modifies the existing dimension in the database.
Returns: True if the updating succeeds.

Tekla.Structures.Drawing.AngleDimension.Delete
Deletes the dimension from the database.
Returns: True if the deletion succeeds.